In [228]:
import numpy as np
import random
import pandas as pd
import os
import re
import seaborn as sns

In [229]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [230]:
data_energy_price = pd.read_csv('/Users/pptrv/IronHack/Week_3-Project/Data/energy_dataset.csv', encoding ='latin1')
data_energy_price.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35064 entries, 0 to 35063
Data columns (total 29 columns):
 #   Column                                       Non-Null Count  Dtype
---  ------                                       --------------  -----
 0   time                                         35064 non-null  object
 1   generation biomass                           35045 non-null  float64
 2   generation fossil brown coal/lignite         35046 non-null  float64
 3   generation fossil coal-derived gas           35046 non-null  float64
 4   generation fossil gas                        35046 non-null  float64
 5   generation fossil hard coal                  35046 non-null  float64
 6   generation fossil oil                        35045 non-null  float64
 7   generation fossil oil shale                  35046 non-null  float64
 8   generation fossil peat                       35046 non-null  float64
 9   generation geothermal                        35046 non-null  float64
 10  generation hydro pumped storage aggregated   0 non-null      float64
 11  generation hydro pumped storage consumption  35045 non-null  float64
 12  generation hydro run-of-river and poundage   35045 non-null  float64
 13  generation hydro water reservoir             35046 non-null  float64
 14  generation marine                            35045 non-null  float64
 15  generation nuclear                           35047 non-null  float64
 16  generation other                             35046 non-null  float64
 17  generation other renewable                   35046 non-null  float64
 18  generation solar                             35046 non-null  float64
 19  generation waste                             35045 non-null  float64
 20  generation wind offshore                     35046 non-null  float64
 21  generation wind onshore                      35046 non-null  float64
 22  forecast solar day ahead                     35064 non-null  float64
 23  forecast wind offshore eday ahead            0 non-null      float64
 24  forecast wind onshore day ahead              35064 non-null  float64
 25  total load forecast                          35064 non-null  float64
 26  total load actual                            35028 non-null  float64
 27  price day ahead                              35064 non-null  float64
 28  price actual                                 35064 non-null  float64
dtypes: float64(28), object(1)
memory usage: 7.8+ MB

The only column needed from this dataset is "price actual" and "time", therefore creating a new dataset with such columns.

In [231]:
data_energy_price = data_energy_price[['time', "price actual"]]

Rename columns:

In [232]:
data_energy_price = data_energy_price.rename(columns={'time': 'Dates'})

In [233]:
data_energy_price = data_energy_price.rename(columns={'price actual': 'energy price'})

In [234]:
data_energy_price.sample(5)

                           Dates  energy price
5031   2015-07-29 16:00:00+02:00         79.40
32037  2018-08-27 22:00:00+02:00         80.76
32175  2018-09-02 16:00:00+02:00         71.10
22058  2017-07-08 03:00:00+02:00         47.27
27285  2018-02-10 21:00:00+01:00         72.81

In [235]:
data_energy_price.sort_values('Dates')

                           Dates  energy price
0      2015-01-01 00:00:00+01:00         65.41
1      2015-01-01 01:00:00+01:00         64.92
2      2015-01-01 02:00:00+01:00         64.48
3      2015-01-01 03:00:00+01:00         59.32
4      2015-01-01 04:00:00+01:00         56.04
...                          ...           ...
35059  2018-12-31 19:00:00+01:00         77.02
35060  2018-12-31 20:00:00+01:00         76.16
35061  2018-12-31 21:00:00+01:00         74.30
35062  2018-12-31 22:00:00+01:00         69.89
35063  2018-12-31 23:00:00+01:00         69.88

[35064 rows x 2 columns]

Furthermore, the hours are not needed, so hours inside column "Dates" will be deleted.

In [236]:
data_energy_price['Dates'] = pd.to_datetime(data_energy_price['Dates'], utc=True)

In [237]:
data_energy_price['Dates'] = pd.to_datetime(data_energy_price['Dates']).dt.date

In [238]:
data_energy_price.sample(3)

            Dates  energy price
7809   2015-11-22         50.72
9032   2016-01-12         48.98
27676  2018-02-27         53.77

In some ocassions we have many rows for the same day. Create one column for each day and calculate the mean price for the day:

In [239]:
data_energy_price = data_energy_price.groupby('Dates')['energy price'].mean().reset_index()

In [240]:
data_energy_price.sample(3)

           Dates  energy price
1025  2017-10-21     59.454167
688   2016-11-18     64.667917
268   2015-09-25     60.249583

In [241]:
data_energy_price.head(10)

        Dates  energy price
0  2014-12-31     65.410000
1  2015-01-01     62.090833
2  2015-01-02     69.443750
3  2015-01-03     65.223333
4  2015-01-04     58.912083
5  2015-01-05     74.598333
6  2015-01-06     68.678750
7  2015-01-07     79.046250
8  2015-01-08     78.559167
9  2015-01-09     76.352500

Lastly, eliminate first raw (dates = 2014-12-31) and last raw (dates =2018-12-31):

In [242]:
data_energy_price = data_energy_price.drop(data_energy_price.index[[0]])
data_energy_price = data_energy_price.drop(data_energy_price.index[[1460]])

In [244]:
data_energy_price.tail

<bound method NDFrame.tail of            Dates  energy price
1     2015-01-01     62.090833
2     2015-01-02     69.443750
3     2015-01-03     65.223333
4     2015-01-04     58.912083
5     2015-01-05     74.598333
...          ...           ...
1456  2018-12-26     69.054167
1457  2018-12-27     72.959583
1458  2018-12-28     69.230417
1459  2018-12-29     62.623333
1460  2018-12-30     64.567083

[1460 rows x 2 columns]>

Final Dataframe:

In [245]:
data_energy_price_final = data_energy_price

Exporting finaf df to csv

In [246]:
data_energy_price_final.to_csv(r'/Users/pptrv/IronHack/Week_3-Project/Data/data_energy_price_final.csv', index = False)